# Untitled - By: JEON - 금 9 22 2023

import time
from machine import I2C as SoftI2C
from pyb import I2C

from MLX90614 import MLX90614

print ("온도센서")

#---------------------------------------------------------------------
# 사용할 I2C 채널을 선택하세요.
# MLX90614의 최대 통신 속도는 100Khz임.
# MLX90614의 경우 J8(P4, P5)을 Software I2C로 설정하면 에러가 발생 함.(원인을 모르겠음)
#---------------------------------------------------------------------
#---------------------------------------------------------------------
# Software I2C 채널
#---------------------------------------------------------------------
I2C_J7 = SoftI2C(scl = 'P2', sda = 'P3', freq = 100000, timeout=50000) #Soft I2C
I2C_J9 = SoftI2C(scl = 'P7', sda = 'P8', freq = 100000, timeout=50000) #Soft I2C
#---------------------------------------------------------------------
I2C_J8 = SoftI2C(scl = 'P4', sda = 'P5', freq = 100000, timeout=50000) #Soft I2C
#---------------------------------------------------------------------

#---------------------------------------------------------------------
# Hardware I2C 채널
#---------------------------------------------------------------------
#I2C_J8 = I2C(2, I2C.MASTER, baudrate = 100000)    #Hardware I2C
#I2C_J9 = I2C(4, I2C.MASTER, baudrate = 100000)    #Hardware I2C
#---------------------------------------------------------------------


GY906 = MLX90614(I2C_J7)

clock = time.clock()
clock.tick()

while True:
    print("대상 온도  %s C"% GY906.getObjCelsius())     #섭씨 대상온도
    print("주변 온도  %s C"% GY906.getEnvCelsius())     #섭씨 주변온도
    print(clock.avg())
    clock.tick()


